ahtn/keyplus/efm8/efm8/mcu/C8051F960/inc/C8051F960_defs.h
//-----------------------------------------------------------------------------
// Page 0x2 sfrs
//-----------------------------------------------------------------------------

SFR (LCD0D0, 0x89);                    // LCD0 Data 0
SFR (LCD0D1, 0x8A);                    // LCD0 Data 1
SFR (LCD0D2, 0x8B);                    // LCD0 Data 2
SFR (LCD0D3, 0x8C);                    // LCD0 Data 3
SFR (LCD0D4, 0x8D);                    // LCD0 Data 4
SFR (LCD0D5, 0x8E);                    // LCD0 Data 5
SFR (LCD0D6, 0x91);                    // LCD0 Data 6
SFR (LCD0D7, 0x92);                    // LCD0 Data 7
SFR (LCD0D8, 0x93);                    // LCD0 Data 8
SFR (LCD0D9, 0x94);                    // LCD0 Data 9
SFR (LCD0DA, 0x95);                    // LCD0 Data A
SFR (LCD0DB, 0x96);                    // LCD0 Data B
SFR (LCD0DC, 0x97);                    // LCD0 Data C
SFR (LCD0DD, 0x99);                    // LCD0 Data D
SFR (LCD0DE, 0x9A);                    // LCD0 Data E
SFR (LCD0DF, 0x9B);                    // LCD0 Data F
SFR (LCD0CNTRST, 0x9C);                // LCD0 Contrast
SFR (LCD0CN, 0x9D);                    // LCD0 Control
SFR (LCD0BLINK, 0x9E);                 // LCD0 Blink Mask
SFR (LCD0TOGR, 0x9F);                  // LCD0 Toggle Rate
SFR (SPI1CFG, 0xA1);                   // SPI1 Configuration
SFR (SPI1CKR, 0xA2);                   // SPI1 Clock Rate Control
SFR (SPI1DAT, 0xA3);                   // SPI1 Data
SFR (LCD0PWR, 0xA4);                   // LCD0 Power
SFR (LCD0CF, 0xA5);                    // LCD0 Configuration
SFR (LCD0VBMCN, 0xA6);                 // LCD0 VBAT Monitor Control
SFR (LCD0CLKDIVL, 0xA9);               // LCD0 Clock Divider Low
SFR (LCD0CLKDIVH, 0xAA);               // LCD0 Clock Divider High
SFR (LCD0MSCN, 0xAB);                  // LCD0 Master Control
SFR (LCD0MSCF, 0xAC);                  // LCD0 Master Configuration
SFR (LCD0CHPCF, 0xAD);                 // LCD0 Charge Pump Configuration
SFR (LCD0CHPMD, 0xAE);                 // LCD0 Charge Pump Mode
SFR (LCD0VBMCF, 0xAF);                 // LCD0 VBAT Monitor Configuration
SFR (DC0CN, 0xB1);                     // DC0 Control
SFR (DC0CF, 0xB2);                     // DC0 Configuration
SFR (DC0MD, 0xB3);                     // DC0 Mode
SFR (LCD0CHPCN, 0xB5);                 // LCD0 Charge Pump Control
SFR (LCD0BUFMD, 0xB6);                 // LCD0 Buffer Mode
SFR (CRC1IN, 0xB9);                    // CRC1 In
SFR (CRC1OUTL, 0xBA);                  // CRC1 Out Low
SFR (CRC1OUTH, 0xBB);                  // CRC1 Out High
SFR (CRC1POLL, 0xBC);                  // CRC1 Polynomial Low
SFR (CRC1POLH, 0xBD);                  // CRC1 Polynomial High
SFR (CRC1CN, 0xBE);                    // CRC1 Control
SFR (PC0STAT, 0xC1);                   // PC0 Status
SFR (ENC0L, 0xC2);                     // ENC0 Low
SFR (ENC0M, 0xC3);                     // ENC0 Middle
SFR (ENC0H, 0xC4);                     // ENC0 High
SFR (ENC0CN, 0xC5);                    // ENC0 Control
SFR (VREGINSDL, 0xC6);                 // VREGIN Switch Delay Low
SFR (VREGINSDH, 0xC7);                 // VREGIN Switch Delay High
SFR (DMA0NCF, 0xC9);                   // DMA0 Configuration
SFR (DMA0NBAL, 0xCA);                  // DMA0 Base Address Low (Selected Channel)
SFR (DMA0NBAH, 0xCB);                  // DMA0 Base Address High (Selected Channel)
SFR (DMA0NAOL, 0xCC);                  // DMA0 Address Offset Low (Selected Channel)
SFR (DMA0NAOH, 0xCD);                  // DMA0 Address Offset High (Selected Channel)
SFR (DMA0NSZL, 0xCE);                  // DMA0 Size Low (Selected Channel)
SFR (DMA0NSZH, 0xCF);                  // DMA0 Size High (Selected Channel)
SFR (DMA0SEL, 0xD1);                   // DMA0 Channel Select
SFR (DMA0EN, 0xD2);                    // DMA0 Enable
SFR (DMA0INT, 0xD3);                   // DMA0 Interrupt
SFR (DMA0MINT, 0xD4);                  // DMA0 Middle Interrupt
SFR (DMA0BUSY, 0xD5);                  // DMA0 Busy
SFR (DMA0NMD, 0xD6);                   // DMA0 Mode (Selected Channel)
SFR (PC0PCF, 0xD7);                    // PC0 Pull-up Configuration
SFR (PC0MD, 0xD9);                     // PC0 Mode
SFR (PC0CTR0L, 0xDA);                  // PC0 Counter 0 Low
SFR (PC0CTR0M, 0xDB);                  // PC0 Counter 0 Middle
SFR (PC0CTR0H, 0xDC);                  // PC0 Counter 0 High
SFR (PC0CTR1L, 0xDD);                  // PC0 Counter 1 Low
SFR (PC0CTR1M, 0xDE);                  // PC0 Counter 1 Middle
SFR (PC0CTR1H, 0xDF);                  // PC0 Counter 1 High
SFR (PC0CMP0L, 0xE1);                  // PC0 Comparator 0 Low
SFR (PC0CMP0M, 0xE2);                  // PC0 Comparator 0 Middle
SFR (PC0CMP0H, 0xE3);                  // PC0 Comparator 0 High
SFR (PC0TH, 0xE4);                     // PC0 Threshold
SFR (AES0BCFG, 0xE9);                  // AES0 Block Configuration
SFR (AES0DCFG, 0xEA);                  // AES0 Data Configuration
SFR (AES0BIN, 0xEB);                   // AES0 Block Input
SFR (AES0XIN, 0xEC);                   // AES0 XOR Input
SFR (AES0KIN, 0xED);                   // AES0 Key Input
SFR (AES0DBA, 0xEE);                   // AES0 Data Byte Address
SFR (AES0KBA, 0xEF);                   // AES0 Key Byte Address
SFR (PC0CMP1L, 0xF1);                  // PC0 Comparator 1 Low
SFR (PC0CMP1M, 0xF2);                  // PC0 Comparator 1 Middle
SFR (PC0CMP1H, 0xF3);                  // PC0 Comparator 1 High
SFR (PC0HIST, 0xF4);                   // PC0 History
SFR (AES0YOUT, 0xF5);                  // AES Y Out
SFR (SPI1CN, 0xF8);                    // SPI1 Control
SFR (PC0DCL, 0xF9);                    // PC0 Debounce Configuration Low
SFR (PC0DCH, 0xFA);                    // PC0 Debounce Configuration high
SFR (PC0INT0, 0xFB);                   // PC0 Interrupt 0
SFR (PC0INT1, 0xFC);                   // PC0 Interrupt 1
SFR (DC0RDY, 0xFD);                    // DC0 Ready

//-----------------------------------------------------------------------------
// Page 0xF sfrs
//-----------------------------------------------------------------------------

