ahtn/keyplus/efm8/efm8/mcu/C8051F960/inc/C8051F960_defs.h
SFR (SFRPGCN, 0x8E);                   // SFR Page Control
SFR (CRC0DAT, 0x91);                   // CRC0 Data
SFR (CRC0CN, 0x92);                    // CRC0 Control
SFR (CRC0IN, 0x93);                    // CRC0 Input
SFR (CRC0FLIP, 0x94);                  // CRC0 Flip
SFR (CRC0AUTO, 0x96);                  // CRC0 Automatic Control
SFR (CRC0CNT, 0x97);                   // CRC0 Automatic Flash Sector Count
SFR (LCD0BUFCN, 0x9C);                 // LCD0 Buffer Control
SFR (P3DRV, 0xA1);                     // Port 3 Drive Strength
SFR (P4DRV, 0xA2);                     // Port 4 Drive Strength
SFR (P5DRV, 0xA3);                     // Port 5 Drive Strength
SFR (P0DRV, 0xA4);                     // Port 0 Drive Strength
SFR (P1DRV, 0xA5);                     // Port 1 Drive Strength
SFR (P2DRV, 0xA6);                     // Port 2 Drive Strength
SFR (P6DRV, 0xAA);                     // Port 6 Drive Strength
SFR (P7DRV, 0xAB);                     // Port 7 Drive Strength
SFR (LCD0BUFCF, 0xAC);                 // LCD0 Buffer Configuration
SFR (P3MDOUT, 0xB1);                   // P3 Mode Out
SFR (OSCIFL, 0xB2);                    // Internal Oscillator Flash
SFR (OSCICL, 0xB3);                    // Internal Oscillator Calibration
SFR (FLSCL, 0xB6);                     // Flash Scale Register
SFR (IREF0CF, 0xB9);                   // Current Reference IREF0 Configuration
SFR (ADC0PWR, 0xBA);                   // ADC0 Burst Mode Power-Up Time
SFR (ADC0TK, 0xBB);                    // ADC0 Tracking Control
SFR (TOFFL, 0xBD);                     // Temperature Offset Low
SFR (TOFFH, 0xBE);                     // Temperature Offset High
SFR (P4, 0xD9);                        // Port 4 Latch
SFR (P5, 0xDA);                        // Port 4 Latch
SFR (P6, 0xDB);                        // Port 4 Latch
SFR (P7, 0xDC);                        // Port 4 Latch
SFR (HWID, 0xE9);                      // Hardware ID
SFR (REVID, 0xEA);                     // Revision ID
SFR (DEVICEID, 0xEB);                  // Device ID
SFR (P3MDIN, 0xF1);                    // Port 3 Input Mode Configuration
SFR (P4MDIN, 0xF2);                    // Port 4 Input Mode Configuration
SFR (P5MDIN, 0xF3);                    // Port 5 Input Mode Configuration
SFR (P6MDIN, 0xF4);                    // Port 6 Input Mode Configuration
SFR (PCLKACT, 0xF5);                   // Peripheral Clock Enable Active Mode
SFR (P4MDOUT, 0xF9);                   // P4 Mode Out
SFR (P5MDOUT, 0xFA);                   // P5 Mode Out
SFR (P6MDOUT, 0xFB);                   // P6 Mode Out
SFR (P7MDOUT, 0xFC);                   // P7 Mode Out
SFR (CLKMODE, 0xFD);                   // Clock Mode
SFR (PCLKEN, 0xFE);                    // Peripheral Clock Enables (LP Idle)

//-----------------------------------------------------------------------------
// 16-bit Register Definitions (might not be supported by all compilers)
//-----------------------------------------------------------------------------

SFR16 (DP, 0x82);                      // Data Pointer
SFR16 (TOFF, 0x85);                    // Temperature Sensor Offset
SFR16 (TMR3RL, 0x92);                  // Timer 3 Reload
SFR16 (TMR3, 0x94);                    // Timer 3 Counter
SFR16 (ADC0, 0xBD);                    // ADC0 Data
SFR16 (ADC0GT, 0xC3);                  // ADC0 Greater-Than Compare
SFR16 (ADC0LT, 0xC5);                  // ADC0 Less-Than Compare
SFR16 (TMR2RL, 0xCA);                  // Timer 2 Reload
SFR16 (TMR2, 0xCC);                    // Timer 2 Counter
SFR16 (PCA0CP5, 0xD2);                 // PCA0 Module 5 Capture/Compare
SFR16 (PCA0CP1, 0xE9);                 // PCA0 Module 1 Capture/Compare
SFR16 (PCA0CP2, 0xEB);                 // PCA0 Module 2 Capture/Compare
SFR16 (PCA0CP3, 0xED);                 // PCA0 Module 3 Capture/Compare
SFR16 (PCA0, 0xF9);                    // PCA0 Counter
SFR16 (PCA0CP0, 0xFB);                 // PCA0 Module 0 Capture/Compare
SFR16 (PCA0CP4, 0xFD);                 // PCA0 Module 4 Capture/Compare

//-----------------------------------------------------------------------------
// Indirect RTC Register Addresses
//-----------------------------------------------------------------------------

#define CAPTURE0  0x00                 // RTC address of CAPTURE0 register
#define CAPTURE1  0x01                 // RTC address of CAPTURE1 register
#define CAPTURE2  0x02                 // RTC address of CAPTURE2 register
#define CAPTURE3  0x03                 // RTC address of CAPTURE3 register
#define RTC0CN    0x04                 // RTC address of RTC0CN register
#define RTC0XCN   0x05                 // RTC address of RTC0XCN register
#define RTC0XCF   0x06                 // RTC address of RTC0XCF register
#define RTC0CF    0x07                 // RTC address of RTC0CF register
#define ALARM0B0  0x08                 // RTC address of ALARM0 Byte 0
#define ALARM0B1  0x09                 // RTC address of ALARM0 Byte 1
#define ALARM0B2  0x0A                 // RTC address of ALARM0 Byte 2
#define ALARM0B3  0x0B                 // RTC address of ALARM0 Byte 3
#define ALARM1B0  0x0C                 // RTC address of ALARM1 Byte 0
#define ALARM1B1  0x0D                 // RTC address of ALARM1 Byte 1
#define ALARM1B2  0x0E                 // RTC address of ALARM1 Byte 2
#define ALARM1B3  0x0F                 // RTC address of ALARM1 Byte 3
#define ALARM2B0  0x10                 // RTC address of ALARM2 Byte 0
#define ALARM2B1  0x11                 // RTC address of ALARM2 Byte 1
#define ALARM2B2  0x12                 // RTC address of ALARM2 Byte 2
#define ALARM2B3  0x13                 // RTC address of ALARM2 Byte 3

//-----------------------------------------------------------------------------
// Address Definitions for Bit-addressable Registers
//-----------------------------------------------------------------------------

#define SFR_P0       0x80
#define SFR_TCON     0x88
#define SFR_P1       0x90
#define SFR_SCON0    0x98
#define SFR_P2       0xA0
#define SFR_IE       0xA8
#define SFR_P3       0xB0
#define SFR_IP       0xB8
#define SFR_SMB0CN   0xC0
#define SFR_TMR2CN   0xC8
#define SFR_PSW      0xD0
#define SFR_PCA0CN   0xD8
#define SFR_ACC      0xE0
#define SFR_ADC0CN   0xE8
#define SFR_B        0xF0
#define SFR_SPI0CN   0xF8
#define SFR_SPI1CN   0xF8

